Repository: mildminihi/CardLoopChallengeGame
Catalog: CardLoopChallengeGame/*.lproj/Localizable.strings
Languages: th

# game_title
source: 🃏 Card Loop Game
th: 🃏 ลูปนรกหมกมุ่น

# stage_of
source: Stage %d of %d
th: ด่าน %d จาก 4

# win_of
source: Number of Wins %d
th: จำนวนการชนะ %d

# stage1_title
source: Red or Black?
th: แดงหรือดำ?

# stage2_title
source: Higher or Lower?
th: สูงหรือต่ำ?

# stage3_title
source: Inside or Outside?
th: ในหรือนอกช่วง?

# stage4_title
source: Guess the Suit
th: ทายดอกของไพ่

# stage5_title
source: Guess is Even/Odd
th: คู่หรือคี่?

# stage6_title
source: Guess is Number/Face
th: ตัวเลขหรือไม่ใช่ตัวเลข?

# stage1_description
source: Guess the color of the next card
th: ทายสีของไพ่ใบต่อไป

# stage2_description
source: Will the next card be higher or lower?
th: ไพ่ใบต่อไปจะสูงกว่าหรือต่ำกว่า?

# stage3_description
source: Will the next card be inside or outside the range?
th: ไพ่ใบต่อไปจะอยู่ในช่วงหรือนอกช่วงของไพ่2ใบก่อนหน้า?

# stage4_description
source: Guess the suit of the next card
th: ทายดอกของไพ่ใบต่อไป

# stage5_description
source: Guess is Even [2,4,6,8,10,Q] or Odd [3,5,7,9,J,K,A]
th: ทายว่าเลขเป็นคู่ (2,4,6,8,10,Q) หรือคี่ (3,5,7,9,J,K,A)

# stage6_description
source: Guess is Number or Face [J,Q,K,A]
th: ทายว่าเป็นตัวเลขหรือไม่ (A ไม่นับว่าเป็นตัวเลข​)

# red_button
source: Red ♥♦
th: แดง ♥♦

# black_button
source: Black ♠♣
th: ดำ ♠♣

# higher_button
source: Higher ↑
th: สูงกว่า ↑

# lower_button
source: Lower ↓
th: ต่ำกว่า ↓

# inside_button
source: Inside ↔
th: ในช่วง ↔

# outside_button
source: Outside ↕
th: นอกช่วง ↕

# spades_button
source: Spades ♠
th: โพดำ ♠

# hearts_button
source: Hearts ♥
th: โพแดง ♥

# diamonds_button
source: Diamonds ♦
th: ข้าวหลามตัด ♦

# clubs_button
source: Clubs ♣
th: ดอกจิก ♣

# odd_button
source: Odd 🂣
th: เลขคี่ 🂣

# even_button
source: Even 🂢
th: เลขคู่ 🂢

# number_button
source: Number 🂢
th: ตัวเลข 🂢

# face_button
source: Face 🃞
th: ไม่ใช่ตัวเลข 🃞

source: Start New Game
th: เริ่มเกมใหม่

source: Next Stage
th: ด่านถัดไป

# correct_card_was
source: Correct! The card was %@
th: ถูกต้อง! ไพ่คือ %@

# wrong_card_was_game_over
source: Wrong! The card was %@. Game Over!
th: ผิด! ไพ่คือ %@ เกมจบ!

# lucky_equal_ranks
source: Lucky! Equal ranks, you advance!
th: โชคดี! ไพ่เท่ากัน คุณผ่านไป!

# correct_card_is_higher_than
source: Correct! %@ is higher than %@
th: ถูกต้อง! %@ สูงกว่า %@

# correct_card_is_lower_than
source: Correct! %@ is lower than %@
th: ถูกต้อง! %@ ต่ำกว่า %@

# wrong_card_is_higher_than
source: Wrong! %@ is higher than %@. Game Over!
th: ผิด! %@ สูงกว่า %@ เกมจบ!

# wrong_card_is_lower_than
source: Wrong! %@ is lower than %@. Game Over!
th: ผิด! %@ ต่ำกว่า %@ เกมจบ!

# lucky_equal_boundary
source: Lucky! Card equals boundary, you advance!
th: โชคดี! ไพ่เท่ากับขอบเขต คุณผ่านไป!

# correct_card_is_inside
source: Correct! %@ is inside the range
th: ถูกต้อง! %@ อยู่ในช่วง

# correct_card_is_outside
source: Correct! %@ is outside the range
th: ถูกต้อง! %@ อยู่นอกช่วง

# wrong_card_is_inside
source: Wrong! %@ is inside the range. Game Over!
th: ผิด! %@ อยู่ในช่วง เกมจบ!

# wrong_card_is_outside
source: Wrong! %@ is outside the range. Game Over!
th: ผิด! %@ อยู่นอกช่วง เกมจบ!

# correct_won_game
source: Correct! You won the game! 🎉
th: ถูกต้อง! คุณชนะแล้ว! 🎉

# wrong_suit_was
source: Wrong! The suit was %@. Game Over!
th: ผิด! หน้าไพ่คือ %@ เกมจบ!

source: Game Over
th: เกมจบ

source: New Game
th: เกมใหม่

# congratulations
source: Congratulations! You won! 🎉
th: ยินดีด้วย! คุณชนะแล้ว! 🎉

# better_luck
source: Better luck next time!
th: คราวหน้าลองใหม่นะจ๊ะ!

# cards_remaining
source: Cards remaining: %d
th: การ์ดที่เหลืออยู่: %d

# stage_label
source: Stage %d
th: ด่าน %d

source: Current Stage
th: ด่านปัจจุบัน

source: Language Selection
th: เลือกภาษา

source: Cancel
th: ยกเลิก

source: Game Overview
th: ภาพรวมเกม

source: Total Games
th: เล่นไปทั้งหมด

# games_won
source: Won
th: ชนะ

# games_lost
source: Loss
th: แพ้

# stats_equal
source: Equal
th: ออกเลขเดิม

# clear_stats
source: Clear
th: ล้างข้อมูล

source: Clear Stats Confirmation
th: ยืนยันการล้างข้อมูล

# clear_stats_message
source: Are you sure you want to clear all stats? This action cannot be undone.
th: คุณแน่ใจหรือว่าต้องการล้างข้อมูลสถิติทั้งหมด? การดำเนินการนี้ไม่สามารถย้อนกลับได้.

# clear_stats_confirm
source: Just Clear!
th: ล้างข้อมูล

# statistics_title
source: 📊 Statistics
th: 📊 สถิติ

source: Endless Mode Overview
th: ภาพรวมโหมดไม่รู้จบ

source: High Score
th: คะแนนสูงสุด

source: Total Endless Games
th: เล่นไปทั้งหมด

source: Stage Encounters
th: ด่านที่พบทั้งหมด

# welcome_message
source: Welcome to the ultimate card guessing challenge!
th: ยินดีต้อนรับสู่เกมทายไพ่ที่ท้าทายที่สุด!

source: Select Game Mode
th: เลือกโหมดเกม

source: Normal Mode
th: โหมดปกติ

# normal_mode_description
source: Classic 4-stage card challenge game
th: เกมทายไพ่ 4 ด่านแบบคลาสสิก

source: Endless Mode
th: โหมดไม่รู้จบ

# endless_mode_description
source: Keep playing until you make a mistake
th: เล่นต่อไปจนกว่าจะเดาผิด

source: Coming Soon
th: เร็วๆ นี้

source: Home
th: หน้าหลัก

# settings_title
source: Settings
th: การตั้งค่า

source: Audio Settings
th: การตั้งค่าเสียง

source: Sound Effects
th: เอฟเฟกต์เสียง

# sound_effects_description
source: Enable sound effects for game actions
th: เปิดใช้งานเสียงเอฟเฟกต์เพื่อประสบการณ์ที่ดียิ่งขึ้น

source: Haptic Settings
th: การตั้งค่า Haptic

source: Haptic Feedback
th: การตอบสนอง Haptic

# enable_haptic_description
source: Enable haptic feedback for button presses
th: เปิดใช้งานการตอบสนอง Haptic สำหรับประสบการณ์ที่ดียิ่งขึ้น

# easy_mode_settings
source: Play in easy mode
th: เล่นในโหมดง่าย

source: Easy mode
th: โหมดง่าย

# easy_mode_description
source: When in easy mode probably percent should show
th: เมื่ออยู่ในโหมดง่ายจะมีเปอร์เซ็นต์บอกความน่าจะเป็นในตัวเลือก
